/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "以下の条件の%1$[いずれかを満たす]@";
"%[All]@ of the following are true" = "以下の条件の%1$[すべてを満たす]@";
"%[None]@ of the following are true" = "以下の条件の%[いずれも満たさない]@";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[種類]@が%2$[任意]@";
"%[Kind]@ is %[applications]@" = "%1$[種類]@が%2$[アプリケーション]@";
"%[Kind]@ is %[documents]@" = "%1$[種類]@が%2$[書類]@";
"%[Kind]@ is %[folders]@" = "%1$[種類]@が%2$[フォルダ]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[種類]@が%3$[すべての]@%2$[イメージ]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[種類]@が%3$[JPEG]@%2$[イメージ]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[種類]@が%3$[TIFF]@%2$[イメージ]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[種類]@が%3$[GIF]@%2$[イメージ]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[種類]@が%3$[PNG]@%2$[イメージ]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[種類]@が%3$[BMP]@%2$[イメージ]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[種類]@が%3$[すべての]@%2$[ミュージック]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[種類]@が%3$[MP3]@%2$[ミュージック]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[種類]@が%3$[AAC]@%2$[ミュージック]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[種類]@が%3$[購入した]@%2$[ミュージック]@";
"%[Kind]@ is %[PDF]@" = "%1$[種類]@が%2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[種類]@が%2$[プレゼンテーション]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[種類]@が%3$[すべての]@%2$[テキスト]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[種類]@が%3$[標準]@%2$[テキスト]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[種類]@が%3$[リッチ]@%2$[テキスト]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[種類]@が%3$[HTML]@%2$[テキスト]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[種類]@が%3$[XML]@%2$[テキスト]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[種類]@が%3$[ソースコード]@%2$[テキスト]@";
"%[Kind]@ is %[movies]@" = "%1$[種類]@が%2$[ムービー]@";
"%[Kind]@ is %[other]@ %@" = "%1$[種類]@が%2$[その他]@%3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@が%3$@%4$[日]@%2$[以内]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@が%3$@%4$[週間]@%2$[以内]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@が%3$@%4$[カ月]@%2$[以内]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@が%3$@%4$[年]@%2$[以内]@";
"%@ is %[exactly]@ %@" = "%1$@が%3$@%2$[と同じ]@";
"%@ is %[before]@ %@" = "%1$@が%3$@%2$[以前]@";
"%@ is %[after]@ %@" = "%1$@が%3$@%2$[以後]@";
"%@ is %[today]@" = "%1$@が%2$[今日]@";
"%@ is %[yesterday]@" = "%1$@が%2$[昨日]@";
"%@ is %[this week]@" = "%1$@が%2$[今週]@";
"%@ is %[this month]@" = "%1$@が%2$[今月]@";
"%@ is %[this year]@" = "%1$@が%2$[今年]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@が%3$@%2$[を含む]@";
"%@ %[begins with]@ %@" = "%1$@が%3$@%2$[で始まる]@";
"%@ %[ends with]@ %@" = "%1$@が%3$@%2$[で終わる]@";
"%@ %[is]@ %@" = "%1$@が%3$@%2$[である]@";
"%@ %[matches]@ %@" = "%1$@が%3$@と%2$[一致]@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@が%2$[いずれか]@";
"%@ %[yes]@" = "%1$@が%2$[はい]@";
"%@ %[no]@" = "%1$@が%2$[いいえ]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[ファイルの可視属性]@が%2$[可視の項目]@";
"%[File invisible]@ %[invisible items]@" = "%1$[ファイルの可視属性]@が%2$[不可視の項目]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[ファイルの可視属性]@が%2$[可視または不可視]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[生のクエリー]@が%2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[ファイル拡張子]@が %3$@ %2$[である]@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@が%3$@%2$[である]@";
"%@ %[is greater than]@ %@" = "%1$@が%3$@%2$[より大きい]@";
"%@ %[is less than]@ %@" = "%1$@が%3$@%2$[より小さい]@";
"%@ %[is not]@ %@" = "%1$@が%3$@%2$[ではない]@";

/* text contents */
"%@ contains %@" = "%1$@が%2$@を含む";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@が%3$@%4$[KB]@%2$[である]@ ";
"%@ %[equals]@ %@ %[MB]@" = "%1$@が%3$@%4$[MB]@%2$[である]@ ";
"%@ %[equals]@ %@ %[GB]@" = "%1$@が%3$@%4$[GB]@%2$[である]@ ";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@が%3$@%4$[KB]@%2$[より小さい]@ ";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@が%3$@%4$[MB]@%2$[より小さい]@ ";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@が%3$@%4$[GB]@%2$[より小さい]@ ";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@が%3$@%4$[KB]@%2$[より大きい]@ ";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@が%3$@%4$[MB]]@%2$[より大きい]@ ";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@が%3$@%4$[GB]@%2$[より大きい]@ ";
"%@ %[is not]@ %@ %[KB]@" = "%1$@が%3$@%4$[KB]@%2$[ではない]@ ";
"%@ %[is not]@ %@ %[MB]@" = "%1$@が%3$@%4$[MB]@%2$[ではない]@ ";
"%@ %[is not]@ %@ %[GB]@" = "%1$@が%3$@%4$[GB]@%2$[ではない]@ ";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@が%3$@時間%4$@分%5$@秒%2$[である]@";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@が%3$@時間%4$@分%5$@秒%2$[より小さい]@";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@が%3$@時間%4$@分%5$@秒%2$[より大きい]@";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@が%3$@時間%4$@分%5$@秒%2$[ではない]@";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%2$@%1$[のテキストに一致する項目]@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[システムファイル]@%2$[を含む]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[システムファイル]@%2$[を含まない]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight 項目]@%2$[を含む]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight 項目]@%2$[を含まない]@";

